AiEdtProbe/src/Catalogs/ProbeItems/ProbeItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ProbeItems</name>
  <attributes>
    <name>Note</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Active</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>State</name>
    <type>
      <types>EnumRef.ProbeState</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Lines</name>
    <attributes>
      <name>Parent</name>
      <type>
        <types>CatalogRef.ProbeItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Qty</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AiEdtProbe/src/CommonModules/ProbeApi/Module.bsl
// Стенд для инструментов AI-EDT.
//
// Модуль намеренно содержит и латинские, и кириллические идентификаторы: часть инструментов
// разбирает исходник регулярными выражениями, а в Java классы \w и \b по умолчанию только ASCII,
// поэтому правило, проверенное лишь на латинице, на реальном коде 1С молча не срабатывает.

#Region Public

// Возвращает активные элементы стенда.
//
// Параметры:
//  Filter - Строка - подстрока для поиска по наименованию; пустая строка снимает отбор.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.ProbeItems - найденные элементы.
//
Function GetItems(Filter) Export

	Query = New Query;
	Query.Text =
	"SELECT
	|	ProbeItems.Ref AS Ref
	|FROM
	|	Catalog.ProbeItems AS ProbeItems
	|WHERE
	|	ProbeItems.Active
	|	AND ProbeItems.Description LIKE &Filter";
	Query.SetParameter("Filter", "%" + NormalizeName(Filter) + "%");

	Return Query.Execute().Unload().UnloadColumn("Ref");

EndFunction

// Считает итог по табличной части элементов.
//
// Запрос намеренно написан по-русски и БЕЗ условия ГДЕ: на нем проверяется правило
// NO_WHERE_ON_LARGE_TABLE, которое до 2026-07-31 не срабатывало на кириллических именах таблиц.
//
// Возвращаемое значение:
//  Число - сумма количества по всем строкам.
//
Функция ПосчитатьИтог() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ProbeItemsLines.Qty КАК Количество
	|ИЗ
	|	Справочник.ProbeItems.Lines КАК ProbeItemsLines";

	Итог = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Итог = Итог + Выборка.Количество;
	КонецЦикла;

	Возврат Итог;

КонецФункции

#EndRegion

#Region Private

// Приводит наименование к виду, пригодному для поиска.
//
// Не экспортная и вызывается только изнутри модуля: на паре экспортный / не экспортный
// проверяется, что разбор структуры модуля различает область видимости.
//
// Параметры:
//  Value - Строка - исходное наименование.
//
// Возвращаемое значение:
//  Строка - наименование без крайних пробелов, в нижнем регистре.
//
Function NormalizeName(Value)

	Return Lower(TrimAll(Value));

EndFunction

#EndRegion
